
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * azurerm_postgresql_flexible_server.postgresql_flexible_server_temp_restore[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_postgresql_flexible_server.postgresql_flexible_server_temp_restore[0] must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "postgresql_flexible_server_temp_restore" {
      ~ administrator_login               = "pgadmin" -> (known after apply)
      - administrator_password_wo_version = 0 -> null
      ~ backup_retention_days             = 35 -> (known after apply)
      - delegated_subnet_id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/postgresql" -> null # forces replacement
      ~ fqdn                              = "toffee-v14-flexible-restore-temp-stg.postgres.database.azure.com" -> (known after apply)
      ~ id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-v14-flexible-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/toffee-v14-flexible-restore-temp-stg" -> (known after apply)
        name                              = "toffee-v14-flexible-restore-temp-stg"
      ~ point_in_time_restore_time_in_utc = "2025-04-10T11:07:58Z" -> (known after apply)
      ~ private_dns_zone_id               = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com" -> (known after apply)
      ~ public_network_access_enabled     = false -> true
      + storage_tier                      = (known after apply)
      ~ tags                              = {
          - "BuiltFrom"           = "https://github.com/HMCTS/sds-toffee-recipes-service.git" -> null
            "application"         = "core"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/sds-toffee-recipes-service.git"
            "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = null
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Platform Operations"
        }
      ~ version                           = "15" -> (known after apply)
      - zone                              = "3" -> null
        # (9 unchanged attributes hidden)

      ~ authentication (known after apply)
      - authentication {
          - active_directory_auth_enabled = true -> null
          - password_auth_enabled         = true -> null
          - tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":647,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->